#include "buyer.h"

int main(){
    setlocale(LC_ALL, "Russian");
    const char *file1 = "data.txt";
    
    const char *data = 
        
"Иванов;Иван;Иванович;Муж;Белорус;180;75;1990.05.15;+375291112233;224000;Беларусь;Брестская;Брестский;Брест;Московская;10;5;4444-5555;BY01BNB\n"
        
"Петрова;Анна;Сергеевна;Жен;Белоруска;165;55;1995.10.02;+375294445566;220000;Беларусь;Минская;Минский;Минск;Победы;1;12;1111-2222;BY02ALFA\n"
        
"Сидоров;Олег;Петрович;Муж;Белорус;175;80;1988.01.20;+375337778899;224015;Беларусь;Брестская;Брестский;Брест;Советская;150;3;9999-8888;BY03BBS\n"
        
"Кузнецова;Елена;Викторовна;Жен;Белоруска;170;60;1994.12.05;+37529555;210000;Беларусь;Витебская;Витебский;Витебск;Кирова;12;44;7777;BY05\n"
        
"Дмитриев;Алексей;Федорович;Муж;Белорус;185;90;1985.07.30;+37529666;224020;Беларусь;Брестская;Брестский;Брест;Суворова;8;102;8888;BY06\n"
        
"Козлова;Мария;Игоревна;Жен;Белоруска;168;58;1996.04.12;+37525444;246000;Беларусь;Гомельская;Гомельский;Гомель;Советская;45;12;3322;BY08\n"
        
"Rossi;Marco;Antonio;Муж;Итальянец;178;72;1993.08.24;+37529000;224005;Беларусь;Брестская;Брестский;Брест;Гоголя;12;4;5566;BY99\n"
        
"Kowalski;Jan;Piotr;Муж;Поляк;185;82;1987.11.10;+37533000;224010;Беларусь;Брестская;Брестский;Брест;Советская;5;2;7788;BY44\n";
    
    Create(file1, data);
    
    const char *file2 = "result.txt";
    Display(file1);
    Find(file1, file2);
   
    Display(file2);

    return 0;
}
